import streamlit as st

def tipe_check():
    if defense_tipe == "ノーマル" and attack_tipe == "かくとう":
        power = 2
    if defense_tipe == "ノーマル" and attack_tipe == "ゴースト":

def damage():
    low_damage = 50 * 2 / 5 *  *  / 50 + 2 * 0.85
    high_damage =50 * 2 / 5 *  *  / 50 + 2 * 1.00


st.title("ダメージ計算アプリ")
defense_tipe = st.selectbox(("タイプ1")["ノーマル","ほのお","みず","でんき","くさ","こおり","かくとう","どく","じめん","ひこう","エスパー","むし","いわ","ゴースト","ドラゴン","あく","はがね","フェアリー"])
defense_tape2= st.selectbox(("タイプ2")["ノーマル","ほのお","みず","でんき","くさ","こおり","かくとう","どく","じめん","ひこう","エスパー","むし","いわ","ゴースト","ドラゴン","あく","はがね","フェアリー"])

attack_tipe = st.selectbox(("タイプ1")["ノーマル","ほのお","みず","でんき","くさ","こおり","かくとう","どく","じめん","ひこう","エスパー","むし","いわ","ゴースト","ドラゴン","あく","はがね","フェアリー"])
attack_tape2= st.selectbox(("タイプ2")["ノーマル","ほのお","みず","でんき","くさ","こおり","かくとう","どく","じめん","ひこう","エスパー","むし","いわ","ゴースト","ドラゴン","あく","はがね","フェアリー"])

power = 1


type_dict={ "ノーマル":{"抜群":[],"半減":["いわ","はがね"],"無効":["ゴースト"]},
            "ほのお":{"抜群":["くさ","こおり","むし","はがね"],"半減":["ほのお","みず","いわ","ドラゴン"],"無効":[]},
            "みず":{"抜群":["ほのお","じめん","いわ"],"半減":["みず","くさ","ドラゴン"],"無効":[]},
            "でんき":{"抜群":["みず","ひこう"],"半減":["でんき","くさ","ドラゴン"],"無効":["じめん"]},
            "くさ":{"抜群":["みず","じめん","いわ"],"半減":["ほのお","くさ","どく","ひこう","むし","ドラゴン","はがね"],"無効":[]},
            "こおり":{"抜群":["くさ","じめん","ひこう","ドラゴン"],"半減":["こおり","みず","こおり","はがね"],"無効":[]},
            "かくとう":{"抜群":["ノーマル","こおり","いわ","あく","はがね"],"半減":["どく","ひこう","エスパー","むし","フェアリー"],"無効":["ゴースト"]},
            "どく":{"抜群":["くさ","フェアリー"],"半減":["どく","じめん","いわ","ゴースト"],"無効":["はがね"]},
            "":{"抜群":[],"半減":[],"無効":[]},
            "":{"抜群":[],"半減":[],"無効":[]},
            "":{"抜群":[],"半減":[],"無効":[]},
            "":{"抜群":[],"半減":[],"無効":[]},
            "":{"抜群":[],"半減":[],"無効":[]},
            "":{"抜群":[],"半減":[],"無効":[]},
            "":{"抜群":[],"半減":[],"無効":[]},
            "":{"抜群":[],"半減":[],"無効":[]},
            "":{"抜群":[],"半減":[],"無効":[]},
            "":{"抜群":[],"半減":[],"無効":[]}}